/** Завдання створити класи:
 *    фігура:
 *      координати:
 *      х, у
 *
 *    багатокутник -> фігура:
 *      вершини[координати],
 *      периметр()
 *
 *    прямокутник -> багатокутник:
 *      довжина,
 *      висота,
 *      площа(),
 *      периметр()
 *
 *    квадрат -> прямокутник:
 *      довжинаСторони,
 *      площа(),
 *      периметр()
 *
 *    круг -> фігура:
 *      радіус,
 *      площа(),
 *      периметр()
 */
var q = 1;
var str = 'string!';
str = 'string';
var str1;
str1 = 'same text';
var num;
num = 1;
var num2 = 2;
var variab = '1';
variab = 0;
variab = false;
var variab2 = '1' + 1;
variab2 = 'true';
variab2 = 1;
var a = 123;
