/** Завдання створити класи:
 *    фігура:
 *      координати:
 *      х, у
 *
 *    багатокутник -> фігура:
 *      вершини[координати],
 *      периметр()
 *
 *    прямокутник -> багатокутник:
 *      довжина,
 *      висота,
 *      площа(),
 *      периметр()
 *
 *    квадрат -> прямокутник:
 *      довжинаСторони,
 *      площа(),
 *      периметр()
 *
 *    круг -> фігура:
 *      радіус,
 *      площа(),
 *      периметр()
 */

const q = 1;
let str = 'string!';
str = 'string';
let str1: string;
str1 = 'same text';
let num: number;
num = 1;
let num2 = 2;
let variab: any = '1';
variab = 0;
variab = false;
let variab2: string | number = '1' + 1;
variab2 = 'true';
variab2 = 1;
const a = 123;
